ale.org
#+TITLE: Emacs Configuration
#+AUTHOR: Alex Lu
#+EMAIL: alexluigit@gmail.com
#+PROPERTY: header-args :mkdirp yes
#+OPTIONS: auto-id:t
#+STARTUP: overview

* Overview
:PROPERTIES:
:CUSTOM_ID: Overview-5d246939
:END:

** About
:PROPERTIES:
:CUSTOM_ID: Overview-About-c1129ead
:END:

This project is my emacs configuration.

*** Structure
:PROPERTIES:
:CUSTOM_ID: Overview-About-Structure-b170db4c
:END:

+ Init file:                      =early-init.el= and =init.el=
+ User options:                   =user.el=
+ Booting and essential defaults: =init/*.el=
+ Main config file:               =ale.org= (this file)

After the bootstrapping process, the tangled code blocks from this file are
evaluated by Emacs.

#+begin_src emacs-lisp :tangle (ale-minimal-config)
;;; minimal.el --- -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp
;;; full.el --- -*- lexical-binding: t -*-
#+end_src

*** COPYING
:PROPERTIES:
:CUSTOM_ID: Overview-About-COPYING-89382013
:END:

Copyright (c) 2020-2021  Alex Lu <alexluigit@gmail.com>

This file is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by the
Free Software Foundation, either version 3 of the License, or (at
your option) any later version.

This file is distributed in the hope that it will be useful, but
WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
General Public License for more details.

You should have received a copy of the GNU General Public License
along with this file.  If not, see <http://www.gnu.org/licenses/>.

** Quickstart
:PROPERTIES:
:CUSTOM_ID: Overview-Quickstart-f3eacf86
:END:
*** Dependencies
:PROPERTIES:
:CUSTOM_ID: Overview-Quickstart-Dependencies-39c01c85
:END:

Here are the dependency list (it might not be a complete list) that this project
required or optionally required.

|-----------------------+-----------------------------+-----------|
| Package               | Description                 | Required? |
|-----------------------+-----------------------------+-----------|
| =fd=                    | A modern =find=               |           |
| =rg=                    | A modern =grep=               |           |
| =exa=                   | A modern =ls=                 |           |
| =git=                   | Version control             |           |
| =noto-fonts-emoji=      | Font for emojis             | optional  |
| =words=                 | English words completion    | optional  |
| =victor-mono-nerd-font= | Default fixed pitch font    | optional  |
| =sarasa-gothic= (font)  | Default variable pitch font | optional  |
| =xdotool=               | Automation tool for X11     | optional  |
|-----------------------+-----------------------------+-----------|

*** Install
:PROPERTIES:
:CUSTOM_ID: Overview-Quickstart-Install-2db8f0c1
:END:

This section contails instructions on how to use this config.

- Make sure to backup your own emacs config before installation.

#+begin_src shell :tangle no
cp -r ~/.emacs.d ~/.emacs.d.bak
#+end_src

- Clone the repo and tangle the config.

#+begin_src shell :tangle no
git clone https://www.github.com/alexluigit/emacs-grandview
# either put it to ~/.emacs.d
mv ~/emacs-grandview ~/.emacs.d
# or conform XDG spec
mv ~/emacs-grandview ~/.config/emacs/
# or use symlink
mv ~/emacs-grandview ~/Code/emacs-grandview
ln -sf ~/Code/emacs-grandview ~/.config/emacs

# Tangle the config
emacs --daemon
emacsclient -e '(kill-emacs)'
#+end_src

*** CLI
:PROPERTIES:
:CUSTOM_ID: Overview-Quickstart-CLI-9a957ea9
:END:

Script for starting up emacs.

+ *Why this bash script?*

  Emacs is a single-threaded program, so if it hangs, we can not
  expect it to evaluate any elisp code.

+ *What does this script do?*

  If this org file get modified, =ale-init-build= function will tangle
  this file.  After the build function finishes, it kill current emacs
  and open emacs with new init file.

  Since =ale-init-build= function is added to =kill-emacs-hook=, emacs
  main process only get killed after the tangle function finishes
  (unless we use '-9' flag in kill command).  In my case, it usually
  takes emacs less than 1s to tangle this org file, so if emacs main
  process keep alive for over 3s after *killall emacs* command, it
  probably means emacs get frozen, so we just kill it with *kill -9*.

+ *How to use this script?*

  You don't need to install this script if you have followed
  =Installation= section. This script will be tangled to
  *~/.local/share/em*, so if you want to get access to =em restart= command from
  terminal, make sure *~/.local/bin/em* is in your *PATH*.

Here is the content of the script.

#+begin_src bash :tangle "~/.local/bin/em" :shebang "#!/usr/bin/env bash"
_is_ime_rime () { [[ -d ~/.config/rime ]] || [[ -d ~/.local/share/fcitx5/rime ]]; }

restart () {
  notify-send "Restarting emacs..." 2>/dev/null
  emacs_pid=$(pidof emacs)
  timeout=300
  counter=0
  killall emacs
  while $(kill -0 $emacs_pid 2>/dev/null) && [[ $counter -lt $timeout ]]; do
    counter=$((counter + 1))
    sleep 0.01
  done
  kill -9 $emacs_pid 2>/dev/null
  [[ $1 == "-p" ]] && rm -rf ~/.cache/emacs/{straight/build} 2>/dev/null
  [[ $1 == "-r" ]] && rm -rf ~/.cache/emacs/ale 2>/dev/null
  [[ $1 == "-R" ]] && rm -rf ~/.cache/emacs/{ale,straight} 2>/dev/null
  _is_ime_rime && GTK_IM_MODULE=emacs XMODIFIERS=@im=emacs emacs --daemon || emacs --daemon
  command -v xdotool >/dev/null 2>&1 && xdotool set_desktop 0
  emacsclient -cne '(delete-file "~/nohup.out")' >/dev/null 2>&1
}

open () { emacs -nw ${@}; }

[[ -z "$@" ]] || ! $(declare -f -F $1 >/dev/null 2>&1) && { open ${@:1}; exit 0; }
$1 ${@:2}
#+end_src

You can also restart emacs by invoking =restart-emacs= command inside
emacs (again, comfirm your $PATH environment variable).

* *CORE*
:PROPERTIES:
:CUSTOM_ID: *CORE*-f9b16bd5
:END:

Load core of =emacs-grandview=. It is *NOT* recommended to delete / comment out this section.

** Editor
:PROPERTIES:
:CUSTOM_ID: *CORE*-Editor-057db42f
:END:

*** Basic editing (simple.el)
:PROPERTIES:
:CUSTOM_ID: *CORE*-Editor-Basic_editing_(simple.el)-c2fc0fd0
:END:

=simple.el= consists of a grab-bag of basic Emacs commands not specifically related to some major mode
or to file-handling.

#+begin_src emacs-lisp
(use-package simple
  :straight (:type built-in))
#+end_src

*** Modal editing (meow.el)
:PROPERTIES:
:CUSTOM_ID: *CORE*-Modal_editing_(meow.el)-e09b77b4
:END:

Unlike =evil-mode=, which tries to create a whole vim emulation in emacs, =meow=
only focus on bringing the goodness of modal editing to vanilla emacs.

You may noticed that I didn't include any keybindings of meow here, that's
because it can be very lengthy and should be configured separately, see
[[#*CORE*-Keybindings-ed05256f][Keybindings]] for details.

If you want to know more about meow or modal editing in general, check out [[https://www.github.com/DoglooksGood/meow][meow]].

**** Autoload
:PROPERTIES:
:header-args:emacs-lisp: :tangle "/home/alex/.cache/emacs/ale/autoload/meow.el"
:CUSTOM_ID: *CORE*-Modal_editing_(meow.el)-Autoload-2a98f6b5
:END:

#+begin_src emacs-lisp
;;; ale/autoload/meow.el --- -*- lexical-binding: t -*-

(require 'meow)

(defvar ale-meow-fallback-key-cmd-alist
  '(("SPC" . consult-buffer)
    ("/" . consult-line))
  "Doc.")

;;;###autoload
(defadvice! +meow-query-replace-ad (fn &rest args)
  "Call `meow-query-replace' and auto fill prompt with region text."
  :around #'meow-query-replace
  (unless (region-active-p) (meow-mark-symbol 1))
  (call-interactively 'kill-ring-save)
  (exchange-point-and-mark)
  (deactivate-mark t)
  (run-with-timer 0.05 nil 'yank)
  (apply fn args))

;;;###autoload
(defun ale-meow-save ()
  (interactive)
  (save-excursion
    (meow--with-selection-fallback
     (meow--prepare-region-for-kill)
     (call-interactively 'kill-ring-save))))

;;;###autoload
(defun ale-meow-escape ()
  (interactive)
  (cond
   ((minibufferp)
    (keyboard-escape-quit))
   ((region-active-p)
    (meow-cancel))
   (t (call-interactively 'execute-extended-command))))

;;;###autoload
(defun ale-meow-with-key-fallback ()
  "Execute fallback command if exists.
If `last-input-event' is bounded to any command in current
major-mode, call that command, otherwise call its fallback
command defined in `ale-meow-fallback-key-cmd-alist'."
  (interactive)
  (let* ((key (meow--parse-input-event last-input-event))
         (rebind-key (concat meow-motion-remap-prefix key)))
    (if (and (key-binding (kbd rebind-key)) (not (derived-mode-p 'special-mode)))
        (meow--execute-kbd-macro rebind-key)
      (funcall (alist-get key ale-meow-fallback-key-cmd-alist #'ignore nil #'string=)))))

;;;###autoload
(defun ale--bounds-of-tag ()
  (meow--bounds-of-regexp "<.*>"))

;;;###autoload
(defun ale--inner-of-tag ()
  (when-let ((pos (ale--bounds-of-tag)))
    (save-mark-and-excursion
      (let (ibeg iend)
        (goto-char (car pos))
        (setq ibeg (search-forward ">"))
        (goto-char (cdr pos))
        (setq iend (search-backward "<"))
        (cons ibeg iend)))))

;;;###autoload
(defun ale-meow-insert ()
  (interactive)
  (meow--switch-state 'insert))

;;;###autoload
(defun ale-meow-insert-at-first-non-whitespace ()
  (interactive)
  (back-to-indentation)
  (meow-insert))
#+end_src

**** Config
:PROPERTIES:
:CUSTOM_ID: *CORE*-Modal_editing_(meow.el)-Config-64c57594
:END:

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(use-package meow
  :straight (meow :type git :depth full :host github :repo "meow-edit/meow")
  :demand t
  :init
  (setq meow-keymap nil)
  (meow-global-mode)
  :config
  (advice-add 'meow--maybe-highlight-num-positions :override #'ignore)
  (advice-add 'meow-start-kmacro-or-insert-counter :around #'silent!)
  (advice-add 'meow-end-or-call-kmacro :around #'silent!)
  (meow--thing-register 'tag #'ale--inner-of-tag #'ale--bounds-of-tag)
  (setq meow-visit-sanitize-completion nil)
  (setq meow-use-clipboard t)
  (setq meow-esc-delay 0.001)
  (setq meow-keypad-describe-delay 0.5)
  (setq meow-select-on-change t)
  (setq meow-cursor-type-normal 'box)
  (setq meow-cursor-type-insert '(bar . 4))
  (setq meow-cursor-type-default 'hbar)
  (setq meow-selection-command-fallback
        '((meow-replace . meow-yank)
          (meow-reverse . back-to-indentation)
          (meow-change . meow-change-char)
          (ale-meow-save . ale-pulse-save-line)
          (meow-kill . meow-kill-whole-line)
          (meow-pop-selection . ale-files-revert-buffer-no-ask)
          (meow-cancel . keyboard-quit)
          (meow-delete . meow-C-d)))
  (setq meow-char-thing-table
        '((?r . round)
          (?b . square) ;; `b' for bracket
          (?c . curly)
          (?s . string)
          (?e . symbol)
          (?w . window)
          (?B . buffer)
          (?p . paragraph)
          (?\[ . line)
          (?\] . line)
          (?d . defun)
          (?i . indent)
          (?t . tag)
          (?x . extend)))
  (add-to-list 'meow-mode-state-list '(helpful-mode . normal))
  (add-to-list 'meow-mode-state-list '(message-buffer-mode . normal)))
#+end_src

*** Quick goto char (avy.el)
:PROPERTIES:
:CUSTOM_ID: *CORE*-Quick_goto_char_(avy.el)-ad47a7e8
:END:

Jump to any visible text.

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(use-package avy
  :config
  (setq avy-timeout-seconds 0.3)
  (setq avy-all-windows nil)
  (setq avy-keys '(?a ?r ?s ?t ?n ?e ?i ?o)))
#+end_src

*** Symbol pairs (embrace.el)
:PROPERTIES:
:CUSTOM_ID: *CORE*-Symbol_pairs_(embrace.el)-3fa63e6e
:END:

=embrace.el= is a package for symbol pairs insert/change/delete which resembles to
=surround.vim= in vim.

I've forked this package to extract =embrace-default-pairs= out, so we can use
keys like ~,r~ to select an inner parenthesis block (this assumes your comma key
has been bound to =meow-inner-of-thing=.)

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(use-package embrace
  :straight
  (embrace :type git :depth full :host github
           :repo "cute-jumper/embrace.el"
           :fork (:host github :repo "alexluigit/embrace.el"))
  :after-call meow--selection-type
  :init
  (setq embrace-default-pairs
        '((?r . ("(" . ")"))
          (?R . ("( " . " )"))
          (?c . ("{" . "}"))
          (?C . ("{ " . " }"))
          (?\[ . ("[" . "]"))
          (?\] . ("[ " . " ]"))
          (?a . ("<" . ">"))
          (?A . ("< " . " >"))
          (?s . ("\"" . "\""))
          (?\' . ("\'" . "\'"))
          (?` . ("`" . "`")))))
#+end_src

*** Keyboard orientation (kbd.el)
:PROPERTIES:
:CUSTOM_ID: *CORE*-Keyboard_orientation_(kbd.el)-bff4df22
:END:

**** Autoload
:PROPERTIES:
:header-args:emacs-lisp: :tangle "/home/alex/.cache/emacs/ale/autoload/kbd.el"
:CUSTOM_ID: *CORE*-Keyboard_orientation_(kbd.el)-Autoload-bdfa18e4
:END:

#+begin_src emacs-lisp
;;; ale/autoload/kbd.el --- -*- lexical-binding: t -*-

;;;###autoload
(defun ale-kbd-C-i-fix ()
  "Make emacs differentiate C-i and Tab keys.

For historical reason, terminal can not tell the difference between
some key storkes. For example, `C-i' and `<tab>', `C-m' and `Return',
etc. By default, emacs follow this convention, but it doesn't mean
emacs are not able to tell the difference. To change this behaviour,
we can use `input-decode-map' to give `C-i' different meaning."
  (if IS-GUI
      (add-hook 'after-make-frame-functions
                (lambda (f) (with-selected-frame f (ale-kbd--C-i-fix-GUI))))
    (add-hook 'window-setup-hook 'ale-kbd--C-i-fix-TERM)))

(defun ale-kbd--C-i-fix-GUI ()
  "Helper for `ale-kbd-C-i-fix'."
  (define-key input-decode-map [?\C-i] [C-i]))

(defun ale-kbd--C-i-fix-TERM ()
  "Helper for `ale-kbd-C-i-fix'."
  (bind-keys
   ("<f6>" . better-jumper-jump-forward)
   :map minibuffer-local-map
   ("<f6>" . forward-char)
   :map meow-insert-state-keymap
   ("<f6>" . ale-insert-ctrl-i)))
#+end_src

**** Config
:PROPERTIES:
:CUSTOM_ID: *CORE*-Keyboard_orientation_(kbd.el)-Config-2df5940c
:END:

For historical reason, terminal can not tell the difference between some key
storkes. For example, =C-i= and =tab=, =C-m= and =Return=, etc. By default, emacs
follow this convention, but it doesn't mean emacs are not able to tell the
difference. To change this behaviour, we can use =input-decode-map= to give =C-i=
different meaning. See =ale-kbd--C-i-fix-GUI= and =ale-kbd--C-i-fix-TERM= for more
details.

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(ale-kbd-C-i-fix)
#+end_src

** Core UI
:PROPERTIES:
:CUSTOM_ID: *CORE*-Core_UI-5777cbac
:END:

*** Window placement (window.el)
:PROPERTIES:
:CUSTOM_ID: *CORE*-Window_placement_(window.el)-932bb9f2
:END:

