ale.org
*** Useful commands using completion (consult.el)
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Useful_commands_using_completion_(consult.el)-f833f527
:END:

Consult implements a set of =consult-<thing>= commands which use
=completing-read= to select from a list of candidates. Consult provides an
enhanced buffer switcher =consult-buffer= and search and navigation commands
like =consult-imenu= and =consult-line=. Searching through multiple files is
supported by the asynchronous =consult-grep= command. Many Consult commands
allow previewing candidates - if a candidate is selected in the completion view,
the buffer shows the candidate immediately.

The Consult commands are compatible with completion systems based on the Emacs
=completing-read= API, including the default completion system, Icomplete,
Selectrum, Vertico and Embark.

**** Autoload
:PROPERTIES:
:header-args:emacs-lisp: :tangle "/home/alex/.cache/emacs/ale/autoload/consult.el"
:CUSTOM_ID: Completion_framework-Useful_commands_using_completion_(consult.el)-Autoload-5cf23958
:END:

#+begin_src emacs-lisp
;;; ale/autoload/consult.el --- -*- lexical-binding: t -*-

(require 'consult)
(autoload 'consult-org "consult-org")

(defun ale-consult-ripgrep-current-file ()
  "Call `consult-ripgrep' for the current buffer (a single file)."
  (interactive)
  (let ((consult-project-root-function #'ignore)
        (consult-ripgrep-args
         (concat "rg "
                 "--null "
                 "--line-buffered "
                 "--color=never "
                 "--line-number "
                 "--smart-case "
                 "--no-heading "
                 "--max-columns=1000 "
                 "--max-columns-preview "
                 "--search-zip "
                 "--with-filename "
                 (shell-quote-argument buffer-file-name))))
    (consult-ripgrep)))

;;;###autoload
(defun ale-consult-line-advisor (fn &rest args)
  "An advice for `consult-line'.

When in a very large file (total lines > 100000), call
`consult-ripgrep' on current file, otherwise execute it
directly."
  (interactive)
  (let ((total-lines (count-lines (point-min) (point-max))))
    (if (> total-lines 100000)
        (ale-consult-ripgrep-current-file)
      (apply fn args))))

;;;###autoload
(defun ale-consult-outline-advisor (fn &rest args)
  "An advice for `consult-outline'.

When in `org-mode', call `consult-org-heading', otherwise call
`consult-outline'."
  (if (derived-mode-p 'org-mode)
      (consult-org-heading)
    (apply fn args)))

;;;###autoload
(defun ale-consult-project-root ()
  (when-let (project (project-current))
    (car (project-roots project))))
#+end_src

**** Config
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Useful_commands_using_completion_(consult.el)-Config-5a35740a
:END:

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(use-package consult
  :after-call minibuffer-setup-hook
  :init
  (setq completion-in-region-function #'consult-completion-in-region)
  (setq register-preview-delay 0.2)
  (setq register-preview-function #'consult-register-format)
  (advice-add #'register-preview :override #'consult-register-window)
  (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
  (advice-add #'consult-outline :around #'ale-consult-outline-advisor)
  (advice-add #'consult-line :around #'ale-consult-line-advisor)
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  :bind
  (nil
   :map meow-normal-state-keymap
   ("/" . consult-line)
   :map ale-mct-map
   ("/" . consult-line-multi)
   ("e" . consult-compile-error)
   ("r" . consult-ripgrep)
   ("k" . consult-keep-lines)
   ("i" . consult-imenu-multi)
   ("f" . consult-focus-lines)
   ("o" . consult-outline)
   ("R" . consult-register)
   ("y" . consult-yank-from-kill-ring)
   ("m" . consult-minor-mode-menu)
   ("c" . consult-complex-command)
   ("C" . consult-mode-command))
  :config
  (setq consult-project-root-function #'ale-consult-project-root)
  (setq consult-line-numbers-widen t)
  (setq consult-async-min-input 3)
  (setq consult-async-input-debounce 0.5)
  (setq consult-async-input-throttle 0.8)
  (setq consult-narrow-key ">"))
#+end_src

*** Keyboard version right-click (embark.el)
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Keyboard_version_right-click_(embark.el)-9bcc9b5b
:END:

This package provides a sort of right-click contextual menu for
Emacs, accessed through the `embark-act' command (which you should
bind to a convenient key), offering you relevant actions to use on
a target determined by the context.

**** Autoload
:PROPERTIES:
:header-args:emacs-lisp: :tangle "/home/alex/.cache/emacs/ale/autoload/embark.el"
:CUSTOM_ID: Completion_framework-Keyboard_version_right-click_(embark.el)-Autoload-81b70035
:END:

#+begin_src emacs-lisp
;;; ale/autoload/embark.el --- -*- lexical-binding: t -*-

(autoload 'consult-grep "consult")
(autoload 'consult-line "consult")
(autoload 'consult-imenu "consult-imenu")
(autoload 'consult-outline "consult")

(defvar ale-embark-become-general-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "g") 'consult-grep)
    map)
  "General custom cross-package `embark-become' keymap.")

(defvar ale-embark-become-line-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "l") 'consult-line)
    (define-key map (kbd "i") 'consult-imenu)
    (define-key map (kbd "s") 'consult-outline) ; as my default is 'M-s s'
    map)
  "Line-specific custom cross-package `embark-become' keymap.")

(defvar embark-become-file+buffer-map)
(autoload 'project-switch-to-buffer "project")
(autoload 'project-find-file "project")

(defvar ale-embark-become-file+buffer-map
  (let ((map (make-sparse-keymap)))
    (set-keymap-parent map embark-become-file+buffer-map)
    (define-key map (kbd "B") 'project-switch-to-buffer)
    (define-key map (kbd "F") 'project-find-file)
    map)
  "File+buffer custom cross-package `embark-become' keymap.")

(defvar embark-become-keymaps)

;;;###autoload
(define-minor-mode ale-embark-keymaps
  "Add or remove keymaps from Embark.
This is based on the value of `ale-embark-add-keymaps'
and is meant to keep things clean in case I ever wish to disable
those so-called 'extras'."
  :init-value nil
  :global t
  (let ((maps '(ale-embark-become-general-map
                ale-embark-become-line-map
                ale-embark-become-file+buffer-map)))
    (if ale-embark-keymaps
        (dolist (map maps)
          (cl-pushnew map embark-become-keymaps))
      (setq embark-become-keymaps
            (dolist (map maps)
              (delete map embark-become-keymaps))))))
#+end_src

**** Config
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Keyboard_version_right-click_(embark.el)-Config-12386c51
:END:

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(use-package embark
  :after-call dired-after-readin-hook minibuffer-setup-hook
  :bind
  (("C-." . embark-act)
   :map minibuffer-local-map ("C-." . embark-act) ("C-," . embark-become)
   :map embark-collect-mode-map ("C-." . embark-act))
  :config
  (use-package embark-consult :demand t)
  (ale-embark-keymaps 1)
  (setq embark-quit-after-action t)
  (setq embark-action-indicator
        (let ((act (propertize "Act" 'face 'success)))
          (cons act (concat act " on '%s'"))))
  (setq embark-become-indicator (propertize "Become" 'face 'warning)))
#+end_src

*** Candidate annotation (marginalia.el)
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Candidate_annotation_(marginalia.el)-9e2b7fe3
:END:

This is a utility jointly developed by Daniel Mendler and Omar Antolín Camarena
that provides annotations to completion candidates.  It is meant to be
framework-agnostic, so it works with Selectrum, Icomplete, vertico, and Embark.


#+begin_src emacs-lisp :tangle (ale-minimal-config)
(use-package marginalia
  :after-call minibuffer-setup-hook
  :config
  (marginalia-mode)
  (setq marginalia-align 'center))
#+end_src

*** Auto completion in buffer (company.el)
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Auto_completion_in_buffer_(company.el)-7737bb99
:END:

=company= is a modular completion framework.  Modules for retrieving completion
candidates are called backends, modules for displaying them are frontends. It
comes with many backends, e.g. =company-etags=.  These are distributed in
separate files and can be used individually.

=tng= in =company-tng-mode= means tab and go, in this mode tab key will complete and
move to the next candidate meanwhile keep company window open.

**** Autoload
:PROPERTIES:
:header-args:emacs-lisp: :tangle "/home/alex/.cache/emacs/ale/autoload/company.el"
:CUSTOM_ID: Completion_framework-Auto_completion_in_buffer_(company.el)-Autoload-d7f5ec68
:END:

#+begin_src emacs-lisp
;;; ale/autoload/company.el --- Extension for company.el -*- lexical-binding: t -*-

(defvar ale-company-disabled-modes '(org-mode))

;;;###autoload
(defun ale-company-enable-ispell (&optional force)
  "Add `company-ispell' to local `company-backends'."
  (interactive "P")
  (require 'company-ispell)
  (when (company-ispell-available)
    (when (or force
              (not (memq major-mode ale-company-disabled-modes)))
      (make-local-variable 'company-backends)
      (if (memq 'company-ispell company-backends)
          (setq-local company-backends (delq 'company-ispell company-backends))
        (add-to-list 'company-backends 'company-ispell)))))
#+end_src

**** Config
:PROPERTIES:
:CUSTOM_ID: Completion_framework-Auto_completion_in_buffer_(company.el)-Config-320bce2c
:END:

#+begin_src emacs-lisp
(use-package company
  :after-call self-insert-command
  :hook
  (text-mode . ale-company-enable-ispell)
  :config
  (global-company-mode)
  (company-tng-mode)
  (setq company-idle-delay 0.0))
#+end_src

** *KEYBINDINGS*
:PROPERTIES:
:CUSTOM_ID: *CORE*-*KEYBINDINGS*-5efa22da
:END:

This section contains all core keybindings of =emacs-grandview=.

*** INSERT
:PROPERTIES:
:CUSTOM_ID: *CORE*-*KEYBINDINGS*-INSERT-82f3f973
:END:

#+begin_src emacs-lisp :tangle (ale-minimal-config)
(bind-keys
 :map meow-insert-state-keymap
 ("C-u" . meow-kill-whole-line)
 ("<C-i>" . meow-right)
 ("C-o" . meow-left))
#+end_src

